In [1]:
import pandas as pd
import numpy as np

In [15]:
data= {'kor':[10,30,50,70],
       'eng':[20,40,60,80],
       'math':[33,44,55,66]}
df = pd.DataFrame(data, index=['a','b','c','d'])
df

   kor  eng  math
a   10   20    33
b   30   40    44
c   50   60    55
d   70   80    66

In [3]:
df+2

   kor  eng  math
a   12   22    35
b   32   42    46
c   52   62    57
d   72   82    68

In [4]:
df['kor'] =2
df

   kor  eng  math
a    2   20    33
b    2   40    44
c    2   60    55
d    2   80    66

In [7]:
df['kor'] =df['kor']+ 2
df

   kor  eng  math
a   12   20    33
b   32   40    44
c   52   60    55
d   72   80    66

In [8]:
df['kor'] =[1,2,3,4]
df

   kor  eng  math
a    1   20    33
b    2   40    44
c    3   60    55
d    4   80    66

In [10]:
df.loc['a':'b', 'eng': ] =2
df

   kor  eng  math
a    1    2     2
b    2    2     2
c    3   60    55
d    4   80    66

In [12]:
df.loc['a':'b', 'eng': ] = df.loc['a':'b', 'eng': ]+2
df

   kor  eng  math
a   10   22    35
b   30   42    46
c   50   60    55
d   70   80    66

In [14]:
#a,b에 대해 국어,수학점수 가산점 10%부여하시요...
# df.loc['a':'b', ['kor','math'] ]=df.loc['a':'b', ['kor','math'] ]*1.1
df.iloc[0:2, [0,2] ]=df.iloc[0:2, [0,2] ]*1.1
df

    kor  eng  math
a  11.0   20  36.3
b  33.0   40  48.4
c  50.0   60  55.0
d  70.0   80  66.0

In [17]:
df.iloc[0:2,1:] =[[1,2],[3,4]]
df

   kor  eng  math
a   10    1     2
b   30    3     4
c   50   60    55
d   70   80    66

In [18]:
df[ [True,False,False,True] ] #row...

   kor  eng  math
a   10    1     2
d   70   80    66

In [21]:
df[ df['kor'] > 30 ]

   kor  eng  math
c   50   60    55
d   70   80    66

In [24]:
n = 30
# df.query('kor>%d'% n )
df.query( f'kor>{n}' )

   kor  eng  math
c   50   60    55
d   70   80    66

In [28]:
df[ (df['kor']==10) | (df['kor']==50) ]['kor']

a    10
c    50
Name: kor, dtype: int64

In [30]:
df.query( 'kor==10 or kor==50')['kor']

a    10
c    50
Name: kor, dtype: int64

In [33]:
df[ (df['kor']>10) & (df['kor']<50) ]

   kor  eng  math
b   30    3     4

In [34]:
df.query( 'kor>10 and kor<50')

   kor  eng  math
b   30    3     4